content/posts/news.md
+++
title = "news"
author = ["Cameron Smith"]
lastmod = 2020-09-24T02:08:19-04:00
slug = "news"
draft = false
+++

## schedule {#schedule}


### see session manager session named \`news journalism\` {#see-session-manager-session-named-news-journalism}


### Check headlines at [PBS NewsHour]({{< relref "PBS_NewsHour" >}}), [The Correspondent]({{< relref "The_Correspondent" >}}), [Undark]({{< relref "Undark" >}}), [The Atlantic]({{< relref "The_Atlantic" >}}), [Propublica]({{< relref "Propublica" >}}), [Quanta magazine]({{< relref "Quanta_magazine" >}}), [Project syndicate]({{< relref "Project_syndicate" >}}), [The Financial Times]({{< relref "The_Financial_Times" >}}), [Bloomberg]({{< relref "Bloomberg" >}}) and [hacker news]({{< relref "hacker_news" >}}) on a daily basis {#check-headlines-at-pbs-newshour--pbs-newshour-dot-md--the-correspondent--the-correspondent-dot-md--undark--undark-dot-md--the-atlantic--the-atlantic-dot-md--propublica--propublica-dot-md--quanta-magazine--quanta-magazine-dot-md--project-syndicate--project-syndicate-dot-md--the-financial-times--the-financial-times-dot-md--bloomberg--bloomberg-dot-md--and-hacker-news--hacker-news-dot-md--on-a-daily-basis}


### Watch [Wall street week]({{< relref "Wall_street_week" >}}) weekly for finance {#watch-wall-street-week--wall-street-week-dot-md--weekly-for-finance}


### Watch [60 minutes]({{< relref "60_minutes" >}}) and [Fareed Zakaria's GPS]({{< relref "Fareed_Zakaria's_GPS" >}}) on a weekly basis {#watch-60-minutes--60-minutes-dot-md--and-fareed-zakaria-s-gps--fareed-zakaria-s-gps-dot-md--on-a-weekly-basis}


### Check [symmetry magazine]({{< relref "symmetry_magazine" >}}), [DW documentary]({{< relref "DW_documentary" >}}), [VPRO documentary]({{< relref "VPRO_documentary" >}}), [PBS frontline]({{< relref "PBS_frontline" >}}), [Foreign affairs magazine]({{< relref "Foreign_affairs_magazine" >}}) weekly {#check-symmetry-magazine--symmetry-magazine-dot-md--dw-documentary--dw-documentary-dot-md--vpro-documentary--vpro-documentary-dot-md--pbs-frontline--pbs-frontline-dot-md--foreign-affairs-magazine--foreign-affairs-magazine-dot-md--weekly}


## links to basic sources for sharing e.g. when someone asks [What are good sources of news?]({{< relref "What_are_good_sources_of_news" >}}) {#links-to-basic-sources-for-sharing-e-dot-g-dot-when-someone-asks-what-are-good-sources-of-news--what-are-good-sources-of-news-dot-md}


## sources {#sources}


### Short-term {#short-term}

<!--list-separator-->

-  PBS

    <!--list-separator-->

    -  [PBS NewsHour]({{< relref "PBS_NewsHour" >}})

<!--list-separator-->

-  Bloomberg

    <!--list-separator-->

    -  [schedule](<https://en.wikipedia.org/wiki/Bloomberg%5FTelevision#New%5FYork%5Fproduction>)

        <!--list-separator-->

        -  Last watch 21:00 \* 1:43 <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-12 Sun&gt;</span></span>

    <!--list-separator-->

    -  Shows

        <!--list-separator-->

        -  Private equity

            <!--list-separator-->

            -  \`Money Undercover\` with Lisa Abramowicz Tuesdays

            <!--list-separator-->

            -  23 minutes

        <!--list-separator-->

        -  ETFs

            <!--list-separator-->

            -  \`ETF IQ\` with Scarlet Fu Wednesdays

            <!--list-separator-->

            -  23 minutes

        <!--list-separator-->

        -  Commodities

            <!--list-separator-->

            -  \`Commodities Edge\` with Alix Steel Thursdays

            <!--list-separator-->

            -  23 minutes

        <!--list-separator-->

        -  Interest rates

            <!--list-separator-->

            -  \`Real Yield\` with Jon Farro Fridays

            <!--list-separator-->

            -  23 minutes

        <!--list-separator-->

        -  Technology

            <!--list-separator-->

            -  \`Best of Bloomberg Technology\` with Emily Chang Fridays

            <!--list-separator-->

            -  48 minutes

        <!--list-separator-->

        -  Economics

            <!--list-separator-->

            -  [Wall street week]({{< relref "Wall_street_week" >}}) with David Westin Fridays at 6pm reboot of original show restarted on <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-01-10 Fri&gt;</span></span>

                ****\*\*****

<!--list-separator-->

-  CBS

    <!--list-separator-->

    -  60 minutes

<!--list-separator-->

-  NBC

    <!--list-separator-->

    -  Meet the press

<!--list-separator-->

-  VOA

    <!--list-separator-->

    -  VOA Africa


### Medium-term {#medium-term}

<!--list-separator-->

-  [The Correspondent]({{< relref "The_Correspondent" >}})

<!--list-separator-->

-  [Undark]({{< relref "Undark" >}})

<!--list-separator-->

-  [The Atlantic]({{< relref "The_Atlantic" >}})

<!--list-separator-->

-  [Project syndicate]({{< relref "Project_syndicate" >}})

<!--list-separator-->

-  [Propublica]({{< relref "Propublica" >}})


### Long-term {#long-term}

<!--list-separator-->

-  [symmetry magazine]({{< relref "symmetry_magazine" >}})

<!--list-separator-->

-  [DW documentary]({{< relref "DW_documentary" >}})

<!--list-separator-->

-  [VPRO documentary]({{< relref "VPRO_documentary" >}})

<!--list-separator-->

-  [PBS frontline]({{< relref "PBS_frontline" >}})

<!--list-separator-->

-  [Council on foreign relations]({{< relref "Council_on_foreign_relations" >}}) [Foreign affairs magazine]({{< relref "Foreign_affairs_magazine" >}})

<!--list-separator-->

-  [Quanta magazine]({{< relref "Quanta_magazine" >}})
